In [13]:
from sqlalchemy import create_engine
import pandas as pd

In [14]:
# Define las credenciales de la base de datos
username = 'root'
password = 'MySQL'
database_name = 'prueba_globant'
host = 'localhost'  # o la IP si es remoto
port = '3306'  # Puerto por defecto de MySQL

In [15]:
# Crea la URL de conexión para SQLAlchemy
database_url = f'mysql+pymysql://{username}:{password}@{host}:{port}/{database_name}'
# Crea el motor de conexión a la base de datos
engine = create_engine(database_url)

In [16]:
jobs_df = pd.read_excel('C:/Users/franc/Downloads/jobs.xlsx', header=None, names=['id', 'job'])

In [17]:
def convert_float_columns_to_int(df, columns_to_convert):
    """
    Convierte las columnas especificadas de un DataFrame de pandas de float a int.

    Parámetros:
    - df: DataFrame de pandas.
    - columns_to_convert: Lista de nombres de columnas para convertir a enteros.

    Retorna:
    - DataFrame con las columnas especificadas convertidas a tipo int.
    """
    for column in columns_to_convert:
        # Comprueba si la columna está en el DataFrame y si es de tipo float
        if column in df.columns and pd.api.types.is_float_dtype(df[column]):
            # Convierte la columna a int
            # Usamos `astype('Int64')` para manejar correctamente los NaNs, 
            # convirtiéndolos a valores enteros NA de pandas.
            df[column] = df[column].astype('Int64')
    return df

In [18]:
columns_to_convert = ['id']
convert_float_columns_to_int(jobs_df, columns_to_convert)

      id                          job
0      1          Marketing Assistant
1      2                     VP Sales
2      3           Biostatistician IV
3      4    Account Representative II
4      5                 VP Marketing
..   ...                          ...
178  179         Software Engineer II
179  180              Statistician IV
180  181         Programmer Analyst I
181  182     Account Representative I
182  183  Administrative Assistant IV

[183 rows x 2 columns]

In [19]:
jobs_df.head()

   id                        job
0   1        Marketing Assistant
1   2                   VP Sales
2   3         Biostatistician IV
3   4  Account Representative II
4   5               VP Marketing

In [20]:
new_row = {'id': 999, 'job': 'unknown'}
jobs_df = jobs_df.append(new_row, ignore_index=True)

C:\Users\franc\AppData\Local\Temp\ipykernel_5116\986931843.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  jobs_df = jobs_df.append(new_row, ignore_index=True)

In [22]:
jobs_df.to_sql('jobs', con=engine, if_exists='append', index=False)

184